Revit 2027 API
BuiltInFailures.MassFailures.OpenAndSolidGeometry Property
 Mass contains both solid and mesh geometry. Mass Floors, volume, and surface area, may appear incorrect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OpenAndSolidGeometry { get; }
Public Shared ReadOnly Property OpenAndSolidGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OpenAndSolidGeometry {
	FailureDefinitionId^ get ();
}
static member OpenAndSolidGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace